apache/nuttx/arch/arm/src/lpc17xx_40xx/hardware/lpc17_40_ethernet.h
/************************************************************************************
 * arch/arm/src/lpc17xx_40xx/hardware/lpc17_40_ethernet.h
 *
 * Licensed to the Apache Software Foundation (ASF) under one or more
 * contributor license agreements.  See the NOTICE file distributed with
 * this work for additional information regarding copyright ownership.  The
 * ASF licenses this file to you under the Apache License, Version 2.0 (the
 * "License"); you may not use this file except in compliance with the
 * License.  You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.  See the
 * License for the specific language governing permissions and limitations
 * under the License.
 *
 ************************************************************************************/

#ifndef __ARCH_ARM_SRC_LPC17XX_40XX_HARDWARE_LPC17_40_ETHERNET_H
#define __ARCH_ARM_SRC_LPC17XX_40XX_HARDWARE_LPC17_40_ETHERNET_H

/************************************************************************************
 * Included Files
 ************************************************************************************/

#include <nuttx/config.h>

#include "chip.h"
#include "hardware/lpc17_40_memorymap.h"

/************************************************************************************
 * Pre-processor Definitions
 ************************************************************************************/

/* Register offsets *****************************************************************/
/* MAC registers */

#define LPC17_40_ETH_MAC1_OFFSET        0x0000 /* MAC configuration register 1 */
#define LPC17_40_ETH_MAC2_OFFSET        0x0004 /* MAC configuration register 2 */
#define LPC17_40_ETH_IPGT_OFFSET        0x0008 /* Back-to-Back Inter-Packet-Gap register */
#define LPC17_40_ETH_IPGR_OFFSET        0x000c /* Non Back-to-Back Inter-Packet-Gap register */
#define LPC17_40_ETH_CLRT_OFFSET        0x0010 /* Collision window / Retry register */
#define LPC17_40_ETH_MAXF_OFFSET        0x0014 /* Maximum Frame register */
#define LPC17_40_ETH_SUPP_OFFSET        0x0018 /* PHY Support register */
#define LPC17_40_ETH_TEST_OFFSET        0x001c /* Test register */
#define LPC17_40_ETH_MCFG_OFFSET        0x0020 /* MII Mgmt Configuration register */
#define LPC17_40_ETH_MCMD_OFFSET        0x0024 /* MII Mgmt Command register */
#define LPC17_40_ETH_MADR_OFFSET        0x0028 /* MII Mgmt Address register */
#define LPC17_40_ETH_MWTD_OFFSET        0x002c /* MII Mgmt Write Data register */
#define LPC17_40_ETH_MRDD_OFFSET        0x0030 /* MII Mgmt Read Data register */
#define LPC17_40_ETH_MIND_OFFSET        0x0034 /* MII Mgmt Indicators register */
#define LPC17_40_ETH_SA0_OFFSET         0x0040 /* Station Address 0 register */
#define LPC17_40_ETH_SA1_OFFSET         0x0044 /* Station Address 1 register */
#define LPC17_40_ETH_SA2_OFFSET         0x0048 /* Station Address 2 register */

/* Control registers */

#define LPC17_40_ETH_CMD_OFFSET         0x0100 /* Command register */
#define LPC17_40_ETH_STAT_OFFSET        0x0104 /* Status register */
#define LPC17_40_ETH_RXDESC_OFFSET      0x0108 /* Receive descriptor base address register */
#define LPC17_40_ETH_RXSTAT_OFFSET      0x010c /* Receive status base address register */
#define LPC17_40_ETH_RXDESCNO_OFFSET    0x0110 /* Receive number of descriptors register */
#define LPC17_40_ETH_RXPRODIDX_OFFSET   0x0114 /* Receive produce index register */
#define LPC17_40_ETH_RXCONSIDX_OFFSET   0x0118 /* Receive consume index register */
#define LPC17_40_ETH_TXDESC_OFFSET      0x011c /* Transmit descriptor base address register */
#define LPC17_40_ETH_TXSTAT_OFFSET      0x0120 /* Transmit status base address register */
#define LPC17_40_ETH_TXDESCRNO_OFFSET   0x0124 /* Transmit number of descriptors register */
#define LPC17_40_ETH_TXPRODIDX_OFFSET   0x0128 /* Transmit produce index register */
#define LPC17_40_ETH_TXCONSIDX_OFFSET   0x012c /* Transmit consume index register */
#define LPC17_40_ETH_TSV0_OFFSET        0x0158 /* Transmit status vector 0 register */
#define LPC17_40_ETH_TSV1_OFFSET        0x015c /* Transmit status vector 1 register */
#define LPC17_40_ETH_RSV_OFFSET         0x0160 /* Receive status vector register */
#define LPC17_40_ETH_FCCNTR_OFFSET      0x0170 /* Flow control counter register */
#define LPC17_40_ETH_FCSTAT_OFFSET      0x0174 /* Flow control status register */

/* Rx filter registers */

#define LPC17_40_ETH_RXFLCTRL_OFFSET    0x0200 /* Receive filter control register */
#define LPC17_40_ETH_RXFLWOLST_OFFSET   0x0204 /* Receive filter WoL status register */
#define LPC17_40_ETH_RXFLWOLCLR_OFFSET  0x0208 /* Receive filter WoL clear register */
#define LPC17_40_ETH_HASHFLL_OFFSET     0x0210 /* Hash filter table LSBs register */
#define LPC17_40_ETH_HASHFLH_OFFSET     0x0214 /* Hash filter table MSBs register */

/* Module control registers */

#define LPC17_40_ETH_INTST_OFFSET       0x0fe0 /* Interrupt status register */
#define LPC17_40_ETH_INTEN_OFFSET       0x0fe4 /* Interrupt enable register */
#define LPC17_40_ETH_INTCLR_OFFSET      0x0fe8 /* Interrupt clear register */
#define LPC17_40_ETH_INTSET_OFFSET      0x0fec /* Interrupt set register */
#define LPC17_40_ETH_PWRDOWN_OFFSET     0x0ff4 /* Power-down register */

/* Register addresses ***************************************************************/
/* MAC registers */

#define LPC17_40_ETH_MAC1               (LPC17_40_ETH_BASE+LPC17_40_ETH_MAC1_OFFSET)
#define LPC17_40_ETH_MAC2               (LPC17_40_ETH_BASE+LPC17_40_ETH_MAC2_OFFSET)
#define LPC17_40_ETH_IPGT               (LPC17_40_ETH_BASE+LPC17_40_ETH_IPGT_OFFSET)
#define LPC17_40_ETH_IPGR               (LPC17_40_ETH_BASE+LPC17_40_ETH_IPGR_OFFSET)
#define LPC17_40_ETH_CLRT               (LPC17_40_ETH_BASE+LPC17_40_ETH_CLRT_OFFSET)
#define LPC17_40_ETH_MAXF               (LPC17_40_ETH_BASE+LPC17_40_ETH_MAXF_OFFSET)
#define LPC17_40_ETH_SUPP               (LPC17_40_ETH_BASE+LPC17_40_ETH_SUPP_OFFSET)
#define LPC17_40_ETH_TEST               (LPC17_40_ETH_BASE+LPC17_40_ETH_TEST_OFFSET)
#define LPC17_40_ETH_MCFG               (LPC17_40_ETH_BASE+LPC17_40_ETH_MCFG_OFFSET)
#define LPC17_40_ETH_MCMD               (LPC17_40_ETH_BASE+LPC17_40_ETH_MCMD_OFFSET)
#define LPC17_40_ETH_MADR               (LPC17_40_ETH_BASE+LPC17_40_ETH_MADR_OFFSET)
#define LPC17_40_ETH_MWTD               (LPC17_40_ETH_BASE+LPC17_40_ETH_MWTD_OFFSET)
#define LPC17_40_ETH_MRDD               (LPC17_40_ETH_BASE+LPC17_40_ETH_MRDD_OFFSET)
#define LPC17_40_ETH_MIND               (LPC17_40_ETH_BASE+LPC17_40_ETH_MIND_OFFSET)
#define LPC17_40_ETH_SA0                (LPC17_40_ETH_BASE+LPC17_40_ETH_SA0_OFFSET)
#define LPC17_40_ETH_SA1                (LPC17_40_ETH_BASE+LPC17_40_ETH_SA1_OFFSET)
#define LPC17_40_ETH_SA2                (LPC17_40_ETH_BASE+LPC17_40_ETH_SA2_OFFSET)

