apache/nuttx/arch/arm/src/lpc17xx_40xx/hardware/lpc17_40_ethernet.h
/* Control registers */

#define LPC17_40_ETH_CMD                (LPC17_40_ETH_BASE+LPC17_40_ETH_CMD_OFFSET)
#define LPC17_40_ETH_STAT               (LPC17_40_ETH_BASE+LPC17_40_ETH_STAT_OFFSET)
#define LPC17_40_ETH_RXDESC             (LPC17_40_ETH_BASE+LPC17_40_ETH_RXDESC_OFFSET)
#define LPC17_40_ETH_RXSTAT             (LPC17_40_ETH_BASE+LPC17_40_ETH_RXSTAT_OFFSET)
#define LPC17_40_ETH_RXDESCNO           (LPC17_40_ETH_BASE+LPC17_40_ETH_RXDESCNO_OFFSET)
#define LPC17_40_ETH_RXPRODIDX          (LPC17_40_ETH_BASE+LPC17_40_ETH_RXPRODIDX_OFFSET)
#define LPC17_40_ETH_RXCONSIDX          (LPC17_40_ETH_BASE+LPC17_40_ETH_RXCONSIDX_OFFSET)
#define LPC17_40_ETH_TXDESC             (LPC17_40_ETH_BASE+LPC17_40_ETH_TXDESC_OFFSET)
#define LPC17_40_ETH_TXSTAT             (LPC17_40_ETH_BASE+LPC17_40_ETH_TXSTAT_OFFSET)
#define LPC17_40_ETH_TXDESCRNO          (LPC17_40_ETH_BASE+LPC17_40_ETH_TXDESCRNO_OFFSET)
#define LPC17_40_ETH_TXPRODIDX          (LPC17_40_ETH_BASE+LPC17_40_ETH_TXPRODIDX_OFFSET)
#define LPC17_40_ETH_TXCONSIDX          (LPC17_40_ETH_BASE+LPC17_40_ETH_TXCONSIDX_OFFSET)
#define LPC17_40_ETH_TSV0               (LPC17_40_ETH_BASE+LPC17_40_ETH_TSV0_OFFSET)
#define LPC17_40_ETH_TSV1               (LPC17_40_ETH_BASE+LPC17_40_ETH_TSV1_OFFSET)
#define LPC17_40_ETH_RSV                (LPC17_40_ETH_BASE+LPC17_40_ETH_RSV_OFFSET)
#define LPC17_40_ETH_FCCNTR             (LPC17_40_ETH_BASE+LPC17_40_ETH_FCCNTR_OFFSET)
#define LPC17_40_ETH_FCSTAT             (LPC17_40_ETH_BASE+LPC17_40_ETH_FCSTAT_OFFSET)

/* Rx filter registers */

#define LPC17_40_ETH_RXFLCTRL           (LPC17_40_ETH_BASE+LPC17_40_ETH_RXFLCTRL_OFFSET)
#define LPC17_40_ETH_RXFLWOLST          (LPC17_40_ETH_BASE+LPC17_40_ETH_RXFLWOLST_OFFSET)
#define LPC17_40_ETH_RXFLWOLCLR         (LPC17_40_ETH_BASE+LPC17_40_ETH_RXFLWOLCLR_OFFSET)
#define LPC17_40_ETH_HASHFLL            (LPC17_40_ETH_BASE+LPC17_40_ETH_HASHFLL_OFFSET)
#define LPC17_40_ETH_HASHFLH            (LPC17_40_ETH_BASE+LPC17_40_ETH_HASHFLH_OFFSET)

/* Module control registers */

#define LPC17_40_ETH_INTST              (LPC17_40_ETH_BASE+LPC17_40_ETH_INTST_OFFSET)
#define LPC17_40_ETH_INTEN              (LPC17_40_ETH_BASE+LPC17_40_ETH_INTEN_OFFSET)
#define LPC17_40_ETH_INTCLR             (LPC17_40_ETH_BASE+LPC17_40_ETH_INTCLR_OFFSET)
#define LPC17_40_ETH_INTSET             (LPC17_40_ETH_BASE+LPC17_40_ETH_INTSET_OFFSET)
#define LPC17_40_ETH_PWRDOWN            (LPC17_40_ETH_BASE+LPC17_40_ETH_PWRDOWN_OFFSET)

/* Register bit definitions *********************************************************/
/* MAC registers */
/* MAC configuration register 1 (MAC1) */

#define ETH_MAC1_RE                     (1 << 0)  /* Bit 0:  Receive enable */
#define ETH_MAC1_PARF                   (1 << 1)  /* Bit 1:  Passall all receive frames */
#define ETH_MAC1_RFC                    (1 << 2)  /* Bit 2:  RX flow control */
#define ETH_MAC1_TFC                    (1 << 3)  /* Bit 3:  TX flow control */
#define ETH_MAC1_LPBK                   (1 << 4)  /* Bit 4:  Loopback */
                                                  /* Bits 5-7: Reserved */
#define ETH_MAC1_TXRST                  (1 << 8)  /* Bit 8:  Reset TX */
#define ETH_MAC1_MCSTXRST               (1 << 9)  /* Bit 9:  Reset MCS/TX */
#define ETH_MAC1_RXRST                  (1 << 10) /* Bit 10: Reset RX */
#define ETH_MAC1_MCSRXRST               (1 << 11) /* Bit 11: Reset MCS/RX */
                                                  /* Bits 12-13: Reserved */
#define ETH_MAC1_SIMRST                 (1 << 14) /* Bit 14: Simulation reset */
#define ETH_MAC1_SOFTRST                (1 << 15) /* Bit 15: Soft reset */
                                                  /* Bits 16-31: Reserved */
/* MAC configuration register 2 (MAC2) */

#define ETH_MAC2_FD                     (1 << 0)  /* Bit 0:  Full duplex */
#define ETH_MAC2_FLC                    (1 << 1)  /* Bit 1:  Frame length checking */
#define ETH_MAC2_HFE                    (1 << 2)  /* Bit 2:  Huge frame enable */
#define ETH_MAC2_DCRC                   (1 << 3)  /* Bit 3:  Delayed CRC */
#define ETH_MAC2_CRCEN                  (1 << 4)  /* Bit 4:  CRC enable */
#define ETH_MAC2_PADCRCEN               (1 << 5)  /* Bit 5:  Pad/CRC enable */
#define ETH_MAC2_VLANPADEN              (1 << 6)  /* Bit 6:  VLAN pad enable */
#define ETH_MAC2_AUTOPADEN              (1 << 7)  /* Bit 7:  Auto detect pad enable */
#define ETH_MAC2_PPE                    (1 << 8)  /* Bit 8:  Pure preamble enforcement */
#define ETH_MAC2_LPE                    (1 << 9)  /* Bit 9:  Long preamble enforcement */
                                                  /* Bits 10-11: Reserved */
#define ETH_MAC2_NBKOFF                 (1 << 12) /* Bit 12: No backoff */
#define ETH_MAC2_BPNBKOFF               (1 << 13) /* Bit 13: Back pressure/no backoff */
#define ETH_MAC2_EXDEF                  (1 << 14) /* Bit 14: Excess defer */
                                                  /* Bits 15-31: Reserved */
/* Back-to-Back Inter-Packet-Gap register (IPGT) */

#define ETH_IPGT_SHIFT                  (0)       /* Bits 0-6 */
#define ETH_IPGT_MASK                   (0x7f << ETH_IPGT_SHIFT)
                                                  /* Bits 7-31: Reserved */
/* Non Back-to-Back Inter-Packet-Gap register (IPGR) */

#define ETH_IPGR_GAP2_SHIFT             (0)       /* Bits 0-6: Gap part 2 */
#define ETH_IPGR_GAP2_MASK              (0x7f << ETH_IPGR_GAP2_SHIFT)
                                                  /* Bit 7: Reserved */
#define ETH_IPGR_GAP1_SHIFT             (8)       /* Bits 8-18: Gap part 1 */
#define ETH_IPGR_GAP1_MASK              (0x7f << ETH_IPGR_GAP2_SHIFT)
                                                  /* Bits 15-31: Reserved */
/* Collision window / Retry register (CLRT) */

#define ETH_CLRT_RMAX_SHIFT             (0)       /* Bits 0-3: Retransmission maximum */
#define ETH_CLRT_RMAX_MASK              (15 << ETH_CLRT_RMAX_SHIFT)
                                                  /* Bits 4-7: Reserved */
#define ETH_CLRT_COLWIN_SHIFT           (8)       /* Bits 8-13: Collision window */
#define ETH_CLRT_COLWIN_MASK            (0x3f << ETH_CLRT_COLWIN_SHIFT)
                                                  /* Bits 14-31: Reserved */
/* Maximum Frame register (MAXF) */

#define ETH_MAXF_SHIFT                  (0)       /* Bits 0-15 */
#define ETH_MAXF_MASK                   (0xffff << ETH_MAXF_SHIFT)
                                                  /* Bits 16-31: Reserved */
/* PHY Support register (SUPP) */
                                                  /* Bits 0-7: Reserved */
#define ETH_SUPP_SPEED                  (1 << 8)  /* Bit 8:  0=10Bps 1=100Bps */
                                                  /* Bits 9-31: Reserved */
/* Test register (TEST) */

#define ETH_TEST_SPQ                    (1 << 0)  /* Bit 0:  Shortcut pause quanta */
#define ETH_TEST_TP                     (1 << 1)  /* Bit 1:  Test pause */
#define ETH_TEST_TBP                    (1 << 2)  /* Bit 2:  Test packpressure */
                                                  /* Bits 3-31: Reserved */
/* MII Mgmt Configuration register (MCFG) */

#define ETH_MCFG_SCANINC                (1 << 0)  /* Bit 0:  Scan increment */
#define ETH_MCFG_SUPPRE                 (1 << 1)  /* Bit 1:  Suppress preamble */
#define ETH_MCFG_CLKSEL_SHIFT           (2)       /* Bits 2-5: Clock select */
#define ETH_MCFG_CLKSEL_MASK            (15 << ETH_MCFG_CLKSEL_SHIFT)
#  define ETH_MCFG_CLKSEL_DIV4          (0 << ETH_MCFG_CLKSEL_SHIFT)
#  define ETH_MCFG_CLKSEL_DIV6          (2 << ETH_MCFG_CLKSEL_SHIFT)
#  define ETH_MCFG_CLKSEL_DIV8          (3 << ETH_MCFG_CLKSEL_SHIFT)
#  define ETH_MCFG_CLKSEL_DIV10         (4 << ETH_MCFG_CLKSEL_SHIFT)
#  define ETH_MCFG_CLKSEL_DIV14         (5 << ETH_MCFG_CLKSEL_SHIFT)
#  define ETH_MCFG_CLKSEL_DIV20         (6 << ETH_MCFG_CLKSEL_SHIFT)
#  define ETH_MCFG_CLKSEL_DIV28         (7 << ETH_MCFG_CLKSEL_SHIFT)
#  define ETH_MCFG_CLKSEL_DIV36         (8 << ETH_MCFG_CLKSEL_SHIFT)
#  define ETH_MCFG_CLKSEL_DIV40         (9 << ETH_MCFG_CLKSEL_SHIFT)
#  define ETH_MCFG_CLKSEL_DIV44         (10 << ETH_MCFG_CLKSEL_SHIFT)
#  define ETH_MCFG_CLKSEL_DIV48         (11 << ETH_MCFG_CLKSEL_SHIFT)
#  define ETH_MCFG_CLKSEL_DIV52         (12 << ETH_MCFG_CLKSEL_SHIFT)
#  define ETH_MCFG_CLKSEL_DIV56         (13 << ETH_MCFG_CLKSEL_SHIFT)
#  define ETH_MCFG_CLKSEL_DIV60         (14 << ETH_MCFG_CLKSEL_SHIFT)
#  define ETH_MCFG_CLKSEL_DIV64         (15 << ETH_MCFG_CLKSEL_SHIFT)
                                                  /* Bits 6-14: Reserved */
#define ETH_MCFG_MIIRST                 (1 << 15) /* Bit 15: Reset MII mgmt */
                                                  /* Bits 16-31: Reserved */
/* MII Mgmt Command register (MCMD) */

