apache/nuttx/arch/arm/src/lpc17xx_40xx/hardware/lpc17_40_ethernet.h
#define ETH_MCMD_READ                   (1 << 0)  /* Bit 0:  Single read cycle */
#define ETH_MCMD_SCAN                   (1 << 1)  /* Bit 1:  Continuous read cycles */
                                                  /* Bits 2-31: Reserved */
#define ETH_MCMD_WRITE                  (0)

/* MII Mgmt Address register (MADR) */

#define ETH_MADR_REGADDR_SHIFT          (0)       /* Bits 0-4: Register address */
#define ETH_MADR_REGADDR_MASK           (31 << ETH_MADR_REGADDR_SHIFT)
                                                  /* Bits 7-5: Reserved */
#define ETH_MADR_PHYADDR_SHIFT          (8)       /* Bits 8-12: PHY address */
#define ETH_MADR_PHYADDR_MASK           (31 << ETH_MADR_PHYADDR_SHIFT)
                                                  /* Bits 13-31: Reserved */
/* MII Mgmt Write Data register (MWTD) */

#define ETH_MWTD_SHIFT                  (0)       /* Bits 0-15 */
#define ETH_MWTD_MASK                   (0xffff << ETH_MWTD_SHIFT)
                                                  /* Bits 16-31: Reserved */
/* MII Mgmt Read Data register (MRDD) */

#define ETH_MRDD_SHIFT                  (0)       /* Bits 0-15 */
#define ETH_MRDD_MASK                   (0xffff << ETH_MRDD_SHIFT)
                                                  /* Bits 16-31: Reserved */
/* MII Mgmt Indicators register (MIND) */

#define ETH_MIND_BUSY                   (1 << 0)  /* Bit 0:  Busy */
#define ETH_MIND_SCANNING               (1 << 1)  /* Bit 1:  Scanning */
#define ETH_MIND_NVALID                 (1 << 2)  /* Bit 2:  Not valid */
#define ETH_MIND_MIIFAIL                (1 << 3)  /* Bit 3:  MII link fail */
                                                  /* Bits 4-31: Reserved */
/* Station Address 0 register (SA0) */

#define ETH_SA0_OCTET2_SHIFT            (0)       /* Bits 0-7: Station address 2nd octet */
#define ETH_SA0_OCTET2_MASK             (0xff << ETH_SA0_OCTET2_SHIFT)
#define ETH_SA0_OCTET1_SHIFT            (8)       /* Bits 8-15: Station address 1st octet */
#define ETH_SA0_OCTET1_MASK             (0xff << ETH_SA0_OCTET1_SHIFT)
                                                  /* Bits 16-31: Reserved */
/* Station Address 1 register (SA1) */

#define ETH_SA1_OCTET4_SHIFT            (0)       /* Bits 0-7: Station address 4th octet */
#define ETH_SA1_OCTET4_MASK             (0xff << ETH_SA0_OCTET4_SHIFT)
#define ETH_SA1_OCTET3_SHIFT            (8)       /* Bits 8-15: Station address 3rd octet */
#define ETH_SA1_OCTET3_MASK             (0xff << ETH_SA0_OCTET3_SHIFT)
                                                  /* Bits 16-31: Reserved */
/* Station Address 2 register (SA2) */

#define ETH_SA2_OCTET6_SHIFT            (0)       /* Bits 0-7: Station address 5th octet */
#define ETH_SA2_OCTET6_MASK             (0xff << ETH_SA0_OCTET6_SHIFT)
#define ETH_SA2_OCTET5_SHIFT            (8)       /* Bits 8-15: Station address 6th octet */
#define ETH_SA2_OCTET5_MASK             (0xff << ETH_SA0_OCTET5_SHIFT)
                                                  /* Bits 16-31: Reserved */
/* Control registers */
/* Command register (CMD) */

#define ETH_CMD_RXEN                    (1 << 0)  /* Bit 0:  Receive enable */
#define ETH_CMD_TXEN                    (1 << 1)  /* Bit 1:  Transmit enable */
                                                  /* Bit 2:  Reserved */
#define ETH_CMD_REGRST                  (1 << 3)  /* Bit 3:  Reset host registers */
#define ETH_CMD_TXRST                   (1 << 4)  /* Bit 4:  Reset transmit datapath */
#define ETH_CMD_RXRST                   (1 << 5)  /* Bit 5:  Reset receive datapath */
#define ETH_CMD_PRFRAME                 (1 << 6)  /* Bit 6:  Pass run frame */
#define ETH_CMD_PRFILTER                (1 << 7)  /* Bit 7:  Pass RX filter */
#define ETH_CMD_TXFC                    (1 << 8)  /* Bit 8:  TX flow control */
#define ETH_CMD_RMII                    (1 << 9)  /* Bit 9:  RMII mode */
#define ETH_CMD_FD                      (1 << 10) /* Bit 10: Full duplex */
                                                  /* Bits 11-31: Reserved */
/* Status register */

#define ETH_STAT_RX                     (1 << 0)  /* Bit 0:  RX status */
#define ETH_STAT_TX                     (1 << 1)  /* Bit 1:  TX status */
                                                  /* Bits 2-31: Reserved */
/* Receive descriptor base address register (RXDESC)
 *
 * The receive descriptor base address is a byte address aligned to a word
 * boundary i.e. LSB 1:0 are fixed to 00. The register contains the lowest
 * address in the array of descriptors.
 */

/* Receive status base address register (RXSTAT)
 *
 * The receive status base address is a byte address aligned to a double word
 * boundary i.e. LSB 2:0 are fixed to 000.
 */

/* Receive number of descriptors register (RXDESCNO) */

#define ETH_RXDESCNO_SHIFT              (0)       /* Bits 0-15 */
#define ETH_RXDESCNO_MASK               (0xffff << ETH_RXDESCNO_SHIFT)
                                                  /* Bits 16-31: Reserved */
/* Receive produce index register (RXPRODIDX) */

#define ETH_RXPRODIDX_SHIFT             (0)       /* Bits 0-15 */
#define ETH_RXPRODIDX_MASK              (0xffff << ETH_RXPRODIDX_SHIFT)
                                                  /* Bits 16-31: Reserved */
/* Receive consume index register (RXCONSIDX) */

#define ETH_RXCONSIDX_SHIFT             (0)       /* Bits 0-15 */
#define ETH_RXCONSIDX_MASK              (0xffff << ETH_RXPRODIDX_SHIFT)
                                                  /* Bits 16-31: Reserved */
/* Transmit descriptor base address register (TXDESC)
 *
 *  The transmit descriptor base address is a byte address aligned to a word
 *  boundary i.e. LSB 1:0 are fixed to 00. The register contains the lowest
 * address in the array of descriptors.
 */

/* Transmit status base address register (TXSTAT)
 *
 * The transmit status base address is a byte address aligned to a word
 * boundary i.e. LSB1:0 are fixed to 00. The register contains the lowest
 * address in the array of statuses.
 */

