apache/nuttx/arch/arm/src/lpc17xx_40xx/hardware/lpc17_40_ethernet.h
/* Transmit number of descriptors register (TXDESCRNO) */

#define ETH_TXDESCRNO_SHIFT             (0)       /* Bits 0-15 */
#define ETH_TXDESCRNO_MASK              (0xffff << ETH_TXDESCRNO_SHIFT)
                                                  /* Bits 16-31: Reserved */
/* Transmit produce index register (TXPRODIDX) */

#define ETH_TXPRODIDX_SHIFT             (0)       /* Bits 0-15 */
#define ETH_TXPRODIDX_MASK              (0xffff << ETH_TXPRODIDX_SHIFT)
                                                  /* Bits 16-31: Reserved */
/* Transmit consume index register (TXCONSIDX) */

#define ETH_TXCONSIDX_SHIFT             (0)       /* Bits 0-15 */
#define ETH_TXCONSIDX_MASK              (0xffff << ETH_TXPRODIDX_SHIFT)
                                                  /* Bits 16-31: Reserved */
/* Transmit status vector 0 register (TSV0) */

#define ETH_TSV0_CRCERR                 (1 << 0)  /* Bit 0:  CRC error */
#define ETH_TSV0_LENCHKERR              (1 << 1)  /* Bit 1:  Length check error */
#define ETH_TSV0_LENOOR                 (1 << 2)  /* Bit 2:  Length out of range */
#define ETH_TSV0_DONE                   (1 << 3)  /* Bit 3:  Done */
#define ETH_TSV0_MCAST                  (1 << 4)  /* Bit 4:  Multicast */
#define ETH_TSV0_BCAST                  (1 << 5)  /* Bit 5:  Broadcast */
#define ETH_TSV0_PKTDEFER               (1 << 6)  /* Bit 6:  Packet Defer */
#define ETH_TSV0_EXCDEFER               (1 << 7)  /* Bit 7:  Excessive Defer */
#define ETH_TSV0_EXCCOL                 (1 << 8)  /* Bit 8:  Excessive Collision */
#define ETH_TSV0_LATECOL                (1 << 9)  /* Bit 9:  Late Collision */
#define ETH_TSV0_GIANT                  (1 << 10) /* Bit 10: Giant */
#define ETH_TSV0_UNDRUN                 (1 << 11) /* Bit 11: Underrun */
#define ETH_TSV0_TOTBYTES_SHIFT         (12)      /* Bits 12-27:Total bytes */
#define ETH_TSV0_TOTBYTES_MASK          (0xffff << ETH_TSV0_TOTBYTES_SHIFT)
#define ETH_TSV0_CTLFRAME               (1 << 28) /* Bit 28: Control frame */
#define ETH_TSV0_PAUSE                  (1 << 29) /* Bit 29: Pause */
#define ETH_TSV0_BP                     (1 << 30) /* Bit 30: Backpressure */
#define ETH_TSV0_VLAN                   (1 << 31) /* Bit 31: VLAN */

/* Transmit status vector 1 register (TSV1) */

#define ETH_TSV1_TXCNT_SHIFT            (0)       /* Bits 0-15: Transmit byte count */
#define ETH_TSV1_TXCNT_MASK             (0xffff << ETH_TSV1_TXCNT_SHIFT)
#define ETH_TSV1_COLCNT_SHIFT           (16)      /* Bits 16-19: Transmit collision count */
#define ETH_TSV1_COLCNT_MASK            (15 << ETH_TSV1_COLCNT_SHIFT)
                                                  /* Bits 20-31: Reserved */
/* Receive status vector register (RSV) */

#define ETH_RSV_RXCNT_SHIFT             (0)       /* Bits 0-15: Received byte count */
#define ETH_RSV_RXCNT_MASK              (0xffff << ETH_RSV_RXCNT_SHIFT)
#define ETH_RSV_PKTPI                   (1 << 16) /* Bit 16: Packet previously ignored */
#define ETH_RSV_RXEPS                   (1 << 17) /* Bit 17: RXDV event previously seen */
#define ETH_RSV_CEPS                    (1 << 18) /* Bit 18: Carrier event previously seen */
#define ETH_RSV_RXCV                    (1 << 19) /* Bit 19: Receive code violation */
#define ETH_RSV_CRCERR                  (1 << 20) /* Bit 20: CRC error */
#define ETH_RSV_LENCHKERR               (1 << 21) /* Bit 21: Length check error */
#define ETH_RSV_LENOOR                  (1 << 22) /* Bit 22: Length out of range */
#define ETH_RSV_RXOK                    (1 << 23) /* Bit 23: Receive OK */
#define ETH_RSV_MCAST                   (1 << 24) /* Bit 24: Multicast */
#define ETH_RSV_BCAST                   (1 << 25) /* Bit 25: Broadcast */
#define ETH_RSV_DRIBNIB                 (1 << 26) /* Bit 26: Dribble Nibble */
#define ETH_RSV_CTLFRAME                (1 << 27) /* Bit 27: Control frame */
#define ETH_RSV_PAUSE                   (1 << 28) /* Bit 28: Pause */
#define ETH_RSV_UNSUPOP                 (1 << 29) /* Bit 29: Unsupported Opcode */
#define ETH_RSV_VLAN                    (1 << 30) /* Bit 30: VLAN */
                                                  /* Bit 31: Reserved */
/* Flow control counter register (FCCNTR) */

#define ETH_FCCNTR_MCOUNT_SHIFT         (0)       /* Bits 0-15: Mirror count */
#define ETH_FCCNTR_MCOUNT_MASK          (0xffff << ETH_FCCNTR_MCOUNT_SHIFT)
#define ETH_FCCNTR_PTMR_SHIFT           (16)      /* Bits 16-31: Pause timer */
#define ETH_FCCNTR_PTMR_MASK            (0xffff << ETH_FCCNTR_PTMR_SHIFT)

/* Flow control status register (FCSTAT) */

#define ETH_FCSTAT_MCOUNT_SHIFT         (0)       /* Bits 0-15: Current mirror count */
#define ETH_FCSTAT_MCOUNT_MASK          (0xffff << ETH_FCSTAT_MCOUNT_SHIFT)
                                                  /* Bits 16-31: Reserved */
/* Rx filter registers */
/* Receive filter control register (RXFLCTRL) */

#define ETH_RXFLCTRL_UCASTEN            (1 << 0)  /* Bit 0:  Accept all unicast frames */
#define ETH_RXFLCTRL_BCASTEN            (1 << 1)  /* Bit 1:  Accept all broadcast frames */
#define ETH_RXFLCTRL_MCASTEN            (1 << 2)  /* Bit 2:  Accept all multicast frames */
#define ETH_RXFLCTRL_UCASTHASHEN        (1 << 3)  /* Bit 3:  Accept hashed unicast */
#define ETH_RXFLCTRL_MCASTHASHEN        (1 << 4)  /* Bit 4:  Accect hashed multicast */
#define ETH_RXFLCTRL_PERFEN             (1 << 5)  /* Bit 5:  Accept perfect dest match */
                                                  /* Bits 6-11: Reserved */
#define ETH_RXFLCTRL_MPKTEN             (1 << 12) /* Bit 12: Magic pkt filter WoL int */
#define ETH_RXFLCTRL_RXFILEN            (1 << 13) /* Bit 13: Perfect match WoL interrupt */
                                                  /* Bits 14-31: Reserved */
/* Receive filter WoL status register (RXFLWOLST) AND
 * Receive filter WoL clear register (RXFLWOLCLR)
 */

#define ETH_RXFLWOL_UCAST               (1 << 0)  /* Bit 0:  Unicast frame WoL */
#define ETH_RXFLWOL_BCAST               (1 << 1)  /* Bit 1:  Broadcast frame WoL */
#define ETH_RXFLWOL_MCAST               (1 << 2)  /* Bit 2:  Multicast frame WoL */
#define ETH_RXFLWOL_UCASTHASH           (1 << 3)  /* Bit 3:  Unicast hash filter WoL */
#define ETH_RXFLWOL_MCASTHASH           (1 << 4)  /* Bit 4:  Multiicast hash filter WoL */
#define ETH_RXFLWOL_PERF                (1 << 5)  /* Bit 5:  Perfect addr match WoL  */
                                                  /* Bit 6:  Reserved */
#define ETH_RXFLWOL_RXFIL               (1 << 7)  /* Bit 7:  Receive filter WoL */
#define ETH_RXFLWOL_MPKT                (1 << 8)  /* Bit 8:  Magic pkt filter WoL */
                                                  /* Bits 9-31: Reserved */
/* Hash filter table LSBs register (HASHFLL) AND Hash filter table MSBs register
* (HASHFLH) Are registers containing a 32-bit value with no bitfield.
 */

/* Module control registers */
/* Interrupt status register (INTST), Interrupt enable register (INTEN), Interrupt
 * clear register (INTCLR), and Interrupt set register (INTSET) common bit field
 * definition:
 */

